{
  "common":{},

  "nav": {
    "home": "home",
    "news": "news",
    "annualEvent":"Annual Event",
    "classes":"classes",
    "professor":"professor",
    "survivalGuide":"survival Guide",
    "diagonAlley":"diagon Alley",
    "about":"about",
    "policy":"policy",
    "member":"member",
    "information":"information",
    "changepassword":"change password",
    "orderslist":"orders list",
    "mycollections":"my collections",
    "coupons":"coupons",
    "logout":"logout",
    "Payment":"Payment",
    "Delivery":"Delivery",
    "Returns":"Returns",
    "privacyPolicy":"privacy Policy"
  },
  "classes":{
    "escTip":"Press Esc To Skip and Stop",

    "motorClass":"Motorcycle",
    "motorIntro1Title":"Daily Life Essential",
    "motorIntro1text":"Motorcycles are vital in Taiwan, offering fast, flexible transportation through busy city streets.",
    "motorIntro2Title":"The Island’s Traffic Icon",
    "motorIntro2Text":"Motorcycles shape Taiwan’s traffic culture, filling intersections, morning commutes, and urban roadways.",
    "motorIntro3Title":"Affordable and Convenient",
    "motorIntro3Text":"Motorcycles provide low-cost, efficient travel, easy parking, and reliable short-distance mobility.",
    "motorIntro4Title":"Tradition Meets Modernity",
    "motorIntro4Text":"Gas and electric motorcycles coexist, reflecting Taiwan’s evolving transportation habits and lifestyle.",
    "motorIntro5Title":"Social and Community Culture",
    "motorIntro5Text":"Riders gather at night markets, scenic routes, and convenience stores, creating shared motorcycle culture.",
    "motorIntro6Title":"Growing Eco-Friendly Trend",
    "motorIntro6Text":"Electric motorcycles rise quickly, supported by charging networks and sustainability incentives.",
    "motorIntro7Intro":"Taiwan’s motorcycle culture defines daily life, providing fast, affordable mobility and shaping the island’s unique traffic, social habits, and modern transportation trends.",
    "motorIntro8Intro":"Taiwan’s “motorcycle waterfall” appears during rush hours, when thousands of motorcycles flow down ramps in dense waves, creating a striking visual symbol of the island’s busy urban mobility.",
    "motorIntro9Intro":"Motorcycle modification in Taiwan blends creativity and personal style, from custom paint and decals to engine tuning and upgraded lights, reflecting each rider’s identity while shaping a vibrant and expressive street culture across the island.",

    "motorGame":"Rider Edition",
    "motorRule1":"1. Controls",
    "motorRule2":"Use the Left and Right Arrow Keys, or drag the motorcycle with your mouse or finger to move across the road.",
    "motorRule3":"2. Objective",
    "motorRule4":"Reach the finish line within the time limit while avoiding all obstacles on the road.",
    "motorRule5":"3. Obstacles & Damage",
    "motorRule6":"Each collision with an obstacle reduces one health point. You have three health points. Losing all three results in game over.",
    "motorRule7":"4. Winning Condition",
    "motorRule8":"Successfully reach the end of the track before time runs out and with at least one remaining health point.",
    "motorRule9":"5. Tips",
    "motorRule10":"Stay alert, react quickly, and keep your motorcycle clear of incoming hazards to survive the run.",
    "motorText1":"You Back To School And Safe.",
    "motorText2":"Safe is the Most Important Thing",
    "motorText3":"You are in a car accident.",
    "motorText4":"Be More Careful",

    "animalTitle":"Endemic Species",
    "animalIntro":"Taiwan’s unique wildlife—from black bears to blue magpies—shows rich biodiversity and highlights the importance of protecting its endemic species.",
    "animalName1":"Formosan Black Bear",
    "animalIntro1":"Taiwan’s iconic bear, known for its crescent chest mark. It lives in high mountains and symbolizes Taiwan’s wildlife.",
    "animalName2":"Formosan Rock Macaque",
    "animalIntro2":"Taiwan’s only native monkey species, highly social and adaptable, often seen in forests and mountainous regions.",
    "animalName3":"Formosan Sika Deer",
    "animalIntro3":"A small, elegant deer once nearly extinct in Taiwan, now restored through conservation efforts.",
    "animalName4":"Formosan Salamander",
    "animalIntro4":"A rare high-altitude amphibian found in cold mountain streams, sensitive to habitat changes.",
    "animalName5":"Taiwan Blue Magpie",
    "animalIntro5":"A striking blue bird with a long tail and cooperative family groups, often called “long-tailed mountain lady.”",
  
    "historyTitle":"History of Magic",
    "historyIntro":"Taiwan’s magical festivals: New Year lights red sparks, Dragon Boats race with charms, Mid-Autumn glows with lanterns and mooncakes, sharing joy under a shining moon.",
    
    "newYearTitle":"New Year",
    "nian":"Nian",
    "nianIntro":"A magical beast attacking villages each New Year, scared away by glowing red spells, booming thunder charms, and enchanted fire to protect everyone.",
    "newYearIntro":"Villagers used magical firecrackers, red charms, and lanterns to scare Nian. They sprinkled fairy dust and prepared enchanted foods to bring safety, health, and luck.",
    "newYearNow1":"Today, people enjoy magical fireworks, lantern parades, and family feasts. Red envelopes hold blessing charms, and online spells, music, and games mix ancient magic with modern fun.",
    "newYearNow2":"Friends ignite brilliant fireworks under a moonlit sky, summoning sparks of enchantment that dance like ancient wishes in the winter air",
    "newYearNow3":"Crimson charms and mystical blessings shimmer on the doorpost, inviting good fortune to swirl in with softly glowing festive magic.",
    
    "dragonBoatTitle":"Dragon-boat Festival",
    "dragonBoatIntro1":"The Legend: Protecting the Dragon Soul When the magical scholar Qu Yuan cast himself into the river, his spirit transformed into a powerful Dragon Soul.",
    "dragonBoatIntro2":"To safeguard him, villagers established three ancient rites:",
    "dragonBoatIntro3":"Dragon Boat Racing: Mystical battles on water to rescue his soul from malevolent spirits.",
    "dragonBoatIntro4":"Enchanted Dumplings: Ritual offerings infused with fortune spells to nourish his essence.",
    "dragonBoatIntro5":"Magical Defense: Hanging calamus and mugwort as talismans to forge a protective barrier.",
    "quYuan":"Qu Yuan",
    "dragonBoatIntro6":"Modern Magic & Energy Alignment The ancient magic persists today through rituals of balance and blessing:",
    "dragonBoatIntro7":"The Noon Alignment: At midday, when world magic reaches equilibrium, the “Egg Balancing” ritual is performed. Success signifies personal alignment and a year of good fortune.",
    "dragonBoatIntro8":"Sacred Celebration: Families gather to feast on enchanted dumplings and hang colorful charms, weaving collective spells of wisdom, courage, and harmony.",
    
    "moonFes":"Mid-Autumn  Festival",
    "moonFesIntro":"Celebrate Chang’e, Wu Gang, and the Jade Rabbit with glowing lanterns, magical mooncakes, and moonlit blessings shared with family and friends.",
    "changE":"CHANG-E",
    "changEIntro":"Moon goddess with magical powers, living in a glowing palace, admired each Mid-Autumn Festival.",
    "yuToo":"YU-TOO",
    "yuTooIntro":"Mystical rabbit brews elixirs on the moon, spreading blessings and inspiring lunar legends.",
    "wuGang":"WU-GANG",
    "wuGangIntro":"Immortal chopping a magical tree endlessly on the moon, symbolizing patience and perseverance.",
    "moonFesIntro1":"Today, families enjoy magical lanterns, mooncakes, and storytelling. People cast blessing spells under the full moon, mixing ancient lunar magic with modern celebration and joy.",
    "moonFesIntro2":"Villagers lit glowing lanterns, offered enchanted mooncakes, and gazed at the magical moon to honor Chang’e, Wu Gang, and the Jade Rabbit’s mystical deeds.",
    
    "charmTitle":"Spells & Charms",
    "charmIntro":"Taiwanese charms and talismans use magic symbols to protect, bring luck, and ward off evil in daily life and festivals.",
    "charmName1":"Talisman of Celestial Banishing",
    "charmText1":"Wards off misfortune and bad luck influences represented by the 'Broom Star.'",
    "charmName2":"Talisman of Conjugal Concord",
    "charmText2":"Soothes marital strife; fosters mutual affection and respect between partners.",
    "charmName3":"Talisman of Night Terror Repulsion",
    "charmText3":"Dispels ominous visions; ensures restful sleep free from evil premonitions.",
    "charmName4":"Talisman of Feline & Canine Restraint",
    "charmText4":"A minor ward to prevent pets from pilfering or consuming forbidden victuals.",
    "charmName5":"Talisman of Discord Mending",
    "charmText5":"Mends broken bonds; restores harmony and affectionate understanding between people.",
    "charmName6":"Talisman of Hearth & Home Sanctity",
    "charmText6":"Binds and fortifies the dwelling; grants lasting peace and stability to inhabitants.",
    "charmName7":"Talisman for Infant's Nocturnal Silence",
    "charmText7":"Soothes restless children; ensures infants remain quiet and sleep through the night.",
    "charmName8":"Talisman of Persistent Intruder Removal",
    "charmText8":"Drives away chronic thievery; secures the premises against repeated burglaries.",
    "charmName9":"Talisman Against Travel Adversity",
    "charmText9":"Guards against perils of transport; ensures a smooth and safe journey by land or water.",
    "charmName10":"Talisman of Dawn Awakening",
    "charmText10":"Instills diligence; compels the user to rise promptly at the break of dawn.",
    "charmName11":"Talisman of Fortuitous Chance",
    "charmText11":"Influences probability, subtly guiding the fall of dice for favorable outcomes.",
    "charmName12":"Zhuge's Veil of Invisibility",
    "charmText12":"A protective charm providing minor camouflage and preventing others from noticing you.",
    "charmName13":"Your Own",
    "charmText13":"A magic charm by you own power and what you thought.",
    "charmName14":"Talisman of Oneiric Rendezvous",
    "charmText14":"Facilitates connection; allows two individuals to meet and communicate within a dream state.",
    "drawText1":"Draw Your Own !",
    "drawText2":"Make Your Product!",

    "potionTitle":"Potions",
    "potionIntro":"Taiwan’s herbal potions refresh, heal, and bring magical energy with natural herbs and soothing flavors.",
    "potion1":"Boba Milk Tea : A creamy blend of black tea and milk, featuring the signature, chewy tapioca.",
    "potion2":"Aiyu Lemon Jelly Drink : Zesty lemon drink featuring slippery, natural aiyu (fig) jelly—a perfect summer cooler.",
    "potion3":"No.1 : Lightly oxidized oolong tea customized with three chewy toppings: boba, pearls, and nata de coco.",
    "potion4":"Winter Melon Lemonade : A perfectly balanced drink: sweet winter melon combined with the refreshing tartness of lemon.",
    "potion5":"Brown Sugar Boba Milk : Warm, chewy pearls simmered in rich brown sugar syrup mixed with fresh milk.",
    "potion6":"Winter Melon Drink with Grass Jelly : Sweet winter melon juice perfectly paired with smooth, cooling herbal grass jelly cubes.",
    "potion7":"Cheese Foam Green Tea : Refreshing green tea topped with a thick, savory, and lightly salted cream foam.",
    "potion8":"Winter Melon Drink with Nata de Coco : Icy, traditional winter melon juice with sweet, chewy pieces of coconut jelly (nata de coco).",

    "divinationTitle":"Divination",
    "divinationIntro":"Taiwanese divination uses magical sticks and lot casting to seek guidance, predict luck, and explore mystical insights.",
    "bueTitle":"Pua̍h-Pue",
    "bueIntro":"Wooden or bamboo blocks are tossed magically to answer yes/no questions, revealing luck and divine will.",
    "bue1Name":"Im-Pue",
    "bue1Intro":"The curved backs turn upward, shielding secrets within. A dark omen bars your path; the ancient forces deny your request. Do not push further.",
    "bue2Name":"Tshiò-Pue",
    "bue2Intro":"Two open faces stare back, mocking your hesitation. The ether finds your query clouded; clear your mind and cast the runes once more for truth.",
    "bue3Name":"Siànn-Pue",
    "bue3Intro":"A perfect harmony of light and shadow lies before you. The cosmos whispers consent, allowing your magic to flow freely into the woven reality.",
    "stickName":"Chōuqiān",
    "stickIntro":"A magical ritual where enchanted lots are drawn to seek guidance and reveal hidden fortunes.",
    "stick1":"The High Council grants you access to primordial magic; your ultimate quest shall succeed now.",   
    "stick2":"A profound connection to the celestial sphere assures a prosperous year of powerful enchantments.",
    "stick3":"Remember to properly calibrate your crystal ball; minor errors are overcome by focused intent.",
    "stick4":"A dusty, forgotten scroll in the ancient library contains the exact answer you have been seeking.",
    "stick5":"Though your invisibility cloak has a small tear, it will still offer minimal protection from detection.",
    "stick6":"A dark hex has been cast upon your prized broomstick; expect serious turbulence during the next flight."
  },
  "professor":{
    "title":"Professor",
    "skillTitle":"Skills: ",
    "name1": "Jiǔtiān Xuánnǚ",
    "job1": "Professor of Divination",
    "skill1": "Prophecy, astrological reading",
    "name2": "Zhōngtán Yuánshuài",
    "job2": "Professor of Spells & Charms",
    "name3": "Guān Shèng Dìjūn",
    "job3": "Commander of Collegiate Enforcement",
    "skill3": "Ethical Mediation & Karmic Tracing Judgement",
    "name4": "Guānyīn Púsà",
    "job4": "Chief Emergency Response Counselor",
    "skill4": "Emergency Rescue & Psycho-Spiritual Healing",
    "name5": "Tiānshàng Shèngmǔ",
    "job5": "Protector of Sailors",
    "skill5": "Storm Benediction & Aetherial Ward",
    "name6": "Chénghuáng Zūnshén",
    "job6": "High Arbiter of Internal Campus Affairs",
    "skill6": "City barrier & mortal mediation",
    "name7": " Hǔyé Jiāngjūn",
    "job7": "Professor of Endemic Species",
    "skill7": "Ethereal Beast Pact Sealing & exorcism charm",
    "name8": "Xuántiān Shàngdì",
    "job8": "Professor of Flying",
    "skill8": "Cloud riding, celestial flight",
    "name9": "Xuántán Zhēnjūn",
    "job9": "Magical Asset Management & Economics",
    "skill9": "Wealth magic, talisman of opportunity",
    "name10": "Fǎzhǔ Shèngjūn",
    "job10": "Professor of Potions",
    "skill10": "Refinement of Vital Energy & Bio-Exorcism Potionology",
    "name11": "Yuèlǎo Zūnshén",
    "job11": "Professor of Magical Bonds and Empathic Divination",
    "skill11": "Red thread magic, fate connection",
    "name12": "Línshuǐ Fūrén",
    "job12": "Professor of Vital Arcana & Supernatural Defense",
    "skill12": "Exorcism of Abominations & mother and child safeguard",
    "name13": "Bǎoshēng Dàdì",
    "job13": "Chief Life-Code Engineer",
    "skill13": "Vitality nurturing & Arcane Herb Synthesis",
    "name14": "Yùhuáng Dàdì",
    "job14": "Professor of History of Magic",
    "skill14": "Celestial history, divine lineage",
    "name15": "Běidǒu Qīxīng",
    "job15": "Professor of Theory of Fate-based Magic",
    "skill15": "Activates the seven-star array to control and reshape the course of fate.",
    "name16": "Nándǒu Liùxīng",
    "job16": "Professors of Vital Sigilcraft",
    "skill16": "Starlit longevity, soul blessing"
  },
  "productdetail":{
    "buynow": "Buy Now",
    "addtocart":"Add to Cart",
    "story":"Story",
    "howtouse":"How to Play / Use",
    "shipping":"Shipping",
    "shippingTitle":"International Home Delivery",
    "shippingContent":"We offer international shipping, delivering products to your specified address anywhere in the world. Once dispatched, you’ll receive global tracking information, allowing you to follow your package every step of the way.",
    "payment": "Payment",
    "paymentTitle1": "Credit Card Instant Online Payment",
    "paymentContent1": "A convenient payment option. When you choose online card payment, the process is secured with SSL encryption to protect your personal and private data.",
    "paymentTitle2": "Apple Pay",
    "paymentContent2": "Experience the ultimate convenience of seamless payment. No more searching for physical cards—simply use biometric authentication on your Apple device for a secure and swift authorization. Apple’s encryption technology ensures your transaction data remains protected throughout the process, making every payment as private as it is effortless.",
    "backtoshop": "Back to Shop"
  },
  "productlist":{
    "folktoys": "Folktoys",
    "personalized":"Personalized",
    "accessories":"Accessories",
    "voucher":"Voucher"
  },
  "survivalguide":{
    "indexpageheader":"Welcome To Survival Guide！",
    "indexpageheaderp":"Here, we'll introduce Taiwan's famous night market culture and convenience store culture.",
    "select":"Select",
    "nightmarket":"Night Market",
    "conveniencestore":"Convenience Store",
    "leftframetext":"Taiwan’s night markets are known for food, games. Stinky tofu, braised pork rice,  are must-tries, showing the heart of local Taiwanese culture.",
    "rightframetext":"Most convenience stores in Taiwan are open 24/7 and offer food, bill payments, shipping, and more—an essential part of daily life.",
    "enterbutton":"ENTER",
    "welcometexttitle":"Welcome!",
    "welcometextdescription":"Feel free to look around—there are different surprises waiting to be discovered. Try clicking to see what's hidden!",
    "startbutton":"START",
    "backbutton":"BACK"
  },
  "nightmarket":{
    "items":{
      "rice": {
        "title":"Braised Pork Rice",
        "subTitle":"(Lu Rou Fan)",
        "popupDesc":"Food: \n Braised Pork Rice",
        "fullText":"Lu rou fan, or braised pork rice, is a popular Taiwanese comfort food made from minced or finely chopped pork belly slowly braised in a savory and slightly sweet soy sauce–based gravy with garlic, shallots, five-spice powder, and Shaoxing rice wine. The pork is cooked until tender and flavorful, then served over hot steamed white rice, creating a rich and satisfying meal loved across Taiwan. This dish is simple yet deeply aromatic, with a balance of salty, sweet, and umami flavors that make it a staple in Taiwanese cuisine."
      },
      "tofu": {
        "title": "Sticky Tofu",
        "subTitle":"(Chou Dou Fu)",
        "popupDesc": "Food: \n Sticky tofu",
        "fullText":"Stinky Tofu is one of Taiwan's most iconic and famous street foods, known for its unique characteristic: 'the stronger the smell, the better the taste.' Made from fermented bean curd, it is typically deep-fried until the skin is golden and crispy, while the inside remains soft and juicy. It is best enjoyed with a side of sweet and sour pickled cabbage and a splash of garlic soy sauce. For travelers, trying Stinky Tofu is the ultimate challenge and a true taste of Taiwanese night market culture."
    },
    "bubble": {
        "title": "Bubble Tea",
        "subTitle":"(Boba Tea)",
        "popupDesc": "Food: \n Bubble tea",
        "fullText":"Bubble Tea, also known as Pearl Milk Tea, is Taiwan's most iconic beverage that has taken the world by storm. It perfectly blends rich, creamy milk tea with chewy tapioca pearls, known locally as 'boba.' The unique combination of the smooth tea and the springy texture of the pearls creates a delightful experience in every sip. Whether served ice-cold or warm, it is the ultimate symbol of Taiwanese innovations in tea culture."
    },
    "sausage": {
        "title": "Taiwanese Sausage With Sticky Rice",
        "subTitle":"(Taiwanese Hot Dog)",
        "popupDesc": "Food: \n Taiwanese sausage with sticky rice",
        "fullText":"Known as the 'Taiwanese Hot Dog,' this snack features a juicy pork sausage wrapped inside a chewy sticky rice 'bun.' Stuffed with garlic, pickled vegetables, and soy paste, it delivers a perfect mix of textures—crispy skin, tender meat, and soft rice—creating a unique savory and sweet flavor."
    },
    "oil": {
        "title": "Scallion Pancake",
        "subTitle":"(Green Onion Pancake)",
        "popupDesc": "Food: \n Scallion pancake",
        "fullText":"Scallion Pancakes are a beloved Taiwanese street snack known for their crispy, flaky layers. Made from dough folded with oil and fresh green onions, they are pan-fried until golden brown. Whether eaten plain or topped with an egg and soy paste, they offer a savory, aromatic bite with a satisfyingly chewy texture."
    },
    "chicken": {
        "title": "Fried Chicken Cutlet",
        "subTitle":"(Taiwanese Fried Chicken)",
        "popupDesc": "Food: \n Scallion pancake",
        "fullText":"Famous for its massive size—often bigger than a human face—the Taiwanese Fried Chicken Cutlet is the king of night market snacks. The chicken breast is flattened, battered, and deep-fried to golden perfection. Seasoned generously with salt, pepper, and five-spice powder, it creates a crispy outer shell while keeping the meat incredibly juicy and tender inside."
    },
    "dice": {
        "title": "Taiwanese Dice Game",
        "subTitle":"(Si-Ba-La)",
        "popupDesc": "Game: \n Dice",
        "fullText":"Ready to test your luck? 'Si-Ba-La' is the loudest and most exciting game in the night market! The rules are simple: throw three dice into the bowl and try to beat the stall owner's score. If your points are higher, you win a delicious sausage! But watch out—competition is fierce. Are you ready to challenge the boss?",
        "buttonText": "START GAME"
    },
    "prawning": {
        "title": "Prawning",
        "subTitle":"(Shrimp Fishing)",
        "popupDesc": "Game: \n Prawning",
        "fullText":"Ready to test your luck? 'Si-Ba-La' is the loudest and most exciting game in the night market! The rules are simple: throw three dice into the bowl and try to beat the stall owner's score. If your points are higher, you win a delicious sausage! But watch out—competition is fierce. Are you ready to challenge the boss?",
        "buttonText": "START GAME"
    },
    "ring-toss": {
        "title": "Ring Toss",
        "subTitle":"(Hoop Toss)",
        "popupDesc": "Game: \n Ring Toss",
        "fullText":"Step right up to the ultimate test of aim and precision! Ring Toss is a legendary night market challenge where things are harder than they look. Your goal? Land a plastic ring around the neck of a bottle or a figurine to win it. It sounds easy, but those rings love to bounce away! Do you have the magic touch to claim the big prize? Line up your shot and let it fly!",
        "buttonText": "START GAME"
    }
  }
  }
}