{
  "nav": {
    "home": "home",
    "news": "news",
    "annualEvent":"Annual Event",
    "classes":"classes",
    "professor":"professor",
    "survivalGuide":"survival Guide",
    "diagonAlley":"diagon Alley",
    "about":"about",
    "policy":"policy",
    "member":"member",
    "information":"information",
    "changepassword":"change password",
    "orderslist":"orders list",
    "mycollections":"my collections",
    "coupons":"coupons",
    "logout":"logout",
    "Payment":"Payment",
    "Delivery":"Delivery",
    "Returns":"Returns",
    "privacyPolicy":"privacy Policy"
  },
  "classes":{
    "escTip":"Press Esc To Skip and Stop",

    "motorClass":"Motorcycle",
    "motorIntro1Title":"Daily Life Essential",
    "motorIntro1text":"Motorcycles are vital in Taiwan, offering fast, flexible transportation through busy city streets.",
    "motorIntro2Title":"The Island’s Traffic Icon",
    "motorIntro2Text":"Motorcycles shape Taiwan’s traffic culture, filling intersections, morning commutes, and urban roadways.",
    "motorIntro3Title":"Affordable and Convenient",
    "motorIntro3Text":"Motorcycles provide low-cost, efficient travel, easy parking, and reliable short-distance mobility.",
    "motorIntro4Title":"Tradition Meets Modernity",
    "motorIntro4Text":"Gas and electric motorcycles coexist, reflecting Taiwan’s evolving transportation habits and lifestyle.",
    "motorIntro5Title":"Social and Community Culture",
    "motorIntro5Text":"Riders gather at night markets, scenic routes, and convenience stores, creating shared motorcycle culture.",
    "motorIntro6Title":"Growing Eco-Friendly Trend",
    "motorIntro6Text":"Electric motorcycles rise quickly, supported by charging networks and sustainability incentives.",
    "motorIntro7Intro":"Taiwan’s motorcycle culture defines daily life, providing fast, affordable mobility and shaping the island’s unique traffic, social habits, and modern transportation trends.",
    "motorIntro8Intro":"Taiwan’s “motorcycle waterfall” appears during rush hours, when thousands of motorcycles flow down ramps in dense waves, creating a striking visual symbol of the island’s busy urban mobility.",
    "motorIntro9Intro":"Motorcycle modification in Taiwan blends creativity and personal style, from custom paint and decals to engine tuning and upgraded lights, reflecting each rider’s identity while shaping a vibrant and expressive street culture across the island.",

    "motorGame":"Rider Edition",
    "motorRule1":"1. Controls",
    "motorRule2":"Use the Left and Right Arrow Keys, or drag the motorcycle with your mouse or finger to move across the road.",
    "motorRule3":"2. Objective",
    "motorRule4":"Reach the finish line within the time limit while avoiding all obstacles on the road.",
    "motorRule5":"3. Obstacles & Damage",
    "motorRule6":"Each collision with an obstacle reduces one health point. You have three health points. Losing all three results in game over.",
    "motorRule7":"4. Winning Condition",
    "motorRule8":"Successfully reach the end of the track before time runs out and with at least one remaining health point.",
    "motorRule9":"5. Tips",
    "motorRule10":"Stay alert, react quickly, and keep your motorcycle clear of incoming hazards to survive the run.",
    "motorText1":"You Back To School And Safe.",
    "motorText2":"Safe is the Most Important Thing",
    "motorText3":"You are in a car accident.",
    "motorText4":"Be More Careful",

    "animalTitle":"Endemic Species",
    "animalIntro":"Taiwan’s unique wildlife—from black bears to blue magpies—shows rich biodiversity and highlights the importance of protecting its endemic species.",
    "animalName1":"Formosan Black Bear",
    "animalIntro1":"Taiwan’s iconic bear, known for its crescent chest mark. It lives in high mountains and symbolizes Taiwan’s wildlife.",
    "animalName2":"Formosan Rock Macaque",
    "animalIntro2":"Taiwan’s only native monkey species, highly social and adaptable, often seen in forests and mountainous regions.",
    "animalName3":"Formosan Sika Deer",
    "animalIntro3":"A small, elegant deer once nearly extinct in Taiwan, now restored through conservation efforts.",
    "animalName4":"Formosan Salamander",
    "animalIntro4":"A rare high-altitude amphibian found in cold mountain streams, sensitive to habitat changes.",
    "animalName5":"Taiwan Blue Magpie",
    "animalIntro5":"A striking blue bird with a long tail and cooperative family groups, often called “long-tailed mountain lady.”",
  
    "historyTitle":"History of Magic",
    "historyIntro":"Taiwan’s magical festivals: New Year lights red sparks, Dragon Boats race with charms, Mid-Autumn glows with lanterns and mooncakes, sharing joy under a shining moon.",
    
    "newYearTitle":"New Year",
    "nian":"Nian",
    "nianIntro":"A magical beast attacking villages each New Year, scared away by glowing red spells, booming thunder charms, and enchanted fire to protect everyone.",
    "newYearIntro":"Villagers used magical firecrackers, red charms, and lanterns to scare Nian. They sprinkled fairy dust and prepared enchanted foods to bring safety, health, and luck.",
    "newYearNow1":"Today, people enjoy magical fireworks, lantern parades, and family feasts. Red envelopes hold blessing charms, and online spells, music, and games mix ancient magic with modern fun.",
    "newYearNow2":"Friends ignite brilliant fireworks under a moonlit sky, summoning sparks of enchantment that dance like ancient wishes in the winter air",
    "newYearNow3":"Crimson charms and mystical blessings shimmer on the doorpost, inviting good fortune to swirl in with softly glowing festive magic.",
    
    "dragonBoatTitle":"Dragon-boat Festival",
    "dragonBoatIntro1":"The Legend: Protecting the Dragon Soul When the magical scholar Qu Yuan cast himself into the river, his spirit transformed into a powerful Dragon Soul.",
    "dragonBoatIntro2":"To safeguard him, villagers established three ancient rites:",
    "dragonBoatIntro3":"Dragon Boat Racing: Mystical battles on water to rescue his soul from malevolent spirits.",
    "dragonBoatIntro4":"Enchanted Dumplings: Ritual offerings infused with fortune spells to nourish his essence.",
    "dragonBoatIntro5":"Magical Defense: Hanging calamus and mugwort as talismans to forge a protective barrier.",
    "quYuan":"Qu Yuan",
    "dragonBoatIntro6":"Modern Magic & Energy Alignment The ancient magic persists today through rituals of balance and blessing:",
    "dragonBoatIntro7":"The Noon Alignment: At midday, when world magic reaches equilibrium, the “Egg Balancing” ritual is performed. Success signifies personal alignment and a year of good fortune.",
    "dragonBoatIntro8":"Sacred Celebration: Families gather to feast on enchanted dumplings and hang colorful charms, weaving collective spells of wisdom, courage, and harmony.",
    
    "moonFes":"Mid-Autumn  Festival",
    "moonFesIntro":"Celebrate Chang’e, Wu Gang, and the Jade Rabbit with glowing lanterns, magical mooncakes, and moonlit blessings shared with family and friends.",
    "changE":"CHANG-E",
    "changEIntro":"Moon goddess with magical powers, living in a glowing palace, admired each Mid-Autumn Festival.",
    "yuToo":"YU-TOO",
    "yuTooIntro":"Mystical rabbit brews elixirs on the moon, spreading blessings and inspiring lunar legends.",
    "wuGang":"WU-GANG",
    "wuGangIntro":"Immortal chopping a magical tree endlessly on the moon, symbolizing patience and perseverance.",
    "moonFesIntro1":"Today, families enjoy magical lanterns, mooncakes, and storytelling. People cast blessing spells under the full moon, mixing ancient lunar magic with modern celebration and joy.",
    "moonFesIntro2":"Villagers lit glowing lanterns, offered enchanted mooncakes, and gazed at the magical moon to honor Chang’e, Wu Gang, and the Jade Rabbit’s mystical deeds.",
    
    "charmTitle":"Spells & Charms",
    "charmIntro":"Taiwanese charms and talismans use magic symbols to protect, bring luck, and ward off evil in daily life and festivals.",
    "charmName1":"Talisman of Celestial Banishing",
    "charmText1":"Wards off misfortune and bad luck influences represented by the 'Broom Star.'",
    "charmName2":"Talisman of Conjugal Concord",
    "charmText2":"Mends broken bonds; restores harmony and affectionate understanding between people.",
    "charmName3":"",
    "charmText3":"",
    "charmName4":"",
    "charmText4":"",
    "charmName5":"",
    "charmText5":"",
    "charmName6":"",
    "charmText6":"",
    "charmName7":"",
    "charmText7":"",
    "charmName8":"",
    "charmText8":"",
    "charmName9":"",
    "charmText9":"",
    "charmName10":"",
    "charmText10":"",
    "charmName11":"",
    "charmText11":"",
    "charmName12":"",
    "charmText12":"",
    "charmName13":"",
    "charmText13":""  
  }
}